openwch/usb-jtag-spi/src/MCU/USB_JTAG_SPI_CH32V30x/USBHS/ch32vf30x_usb_device.h
#define USBHS_TOG_MATCH               (1<<6)

// 00: OUT, 01:SOF, 10:IN, 11:SETUP
#define PID_OUT             0
#define PID_SOF             1
#define PID_IN              2
#define PID_SETUP           3

#define USBHSD              ((USBHSD_TypeDef *) USBHS_BASE)
/******************************************************************************/
/* USBHS PHY Clock Config (RCC_CFGR2) */
#define USB_48M_CLK_SRC_MASK   (1<<31)
#define USB_48M_CLK_SRC_SYS    (0<<31)
#define USB_48M_CLK_SRC_PHY    (1<<31)

#define USBHS_PLL_ALIVE        (1<<30)

#define USBHS_PLL_CKREF_MASK   (3<<28)
#define USBHS_PLL_CKREF_3M     (0<<28)
#define USBHS_PLL_CKREF_4M     (1<<28)
#define USBHS_PLL_CKREF_8M     (2<<28)
#define USBHS_PLL_CKREF_5M     (3<<28)

#define USBHS_PLL_SRC_MASK     (1<<27)
#define USBHS_PLL_SRC_HSE      (0<<27)
#define USBHS_PLL_SRC_HSI      (1<<27)

#define USBHS_PLL_SRC_PRE_MASK (7<<24)
#define USBHS_PLL_SRC_PRE_DIV1 (0<<24)
#define USBHS_PLL_SRC_PRE_DIV2 (1<<24)
#define USBHS_PLL_SRC_PRE_DIV3 (2<<24)
#define USBHS_PLL_SRC_PRE_DIV4 (3<<24)
#define USBHS_PLL_SRC_PRE_DIV5 (4<<24)
#define USBHS_PLL_SRC_PRE_DIV6 (5<<24)
#define USBHS_PLL_SRC_PRE_DIV7 (6<<24)
#define USBHS_PLL_SRC_PRE_DIV8 (7<<24)

#define PHY_SUSPENDM            (1<<4)

/******************************************************************************/
/* HID类请求 */
#define DEF_USB_GET_IDLE           0x02                                         /* get idle for key or mouse */
#define DEF_USB_GET_PROTOCOL       0x03                                         /* get protocol for bios type */
#define DEF_USB_SET_REPORT         0x09                                         /* set report for key */
#define DEF_USB_GET_REPORT         0x01
#define DEF_USB_SET_IDLE           0x0A                                         /* set idle for key or mouse */
#define DEF_USB_SET_PROTOCOL       0x0B                                         /* set protocol for bios type */

/******************************************************************************/
/* 端点大小相关宏定义 */
#define DEF_USB_EP0_SIZE           64                                           /* 端点0大小 */
#define DEF_USB_EP1_FS_SIZE        64                                           /* 端点1大小 */
#define DEF_USB_EP1_HS_SIZE        512                                          /* 端点1大小 */
#define DEF_USB_EP2_FS_SIZE        64                                           /* 端点2全速模式大小 */
#define DEF_USB_EP2_HS_SIZE        512                                          /* 端点2高速模式大小 */
#define DEF_USB_EP3_FS_SIZE        64                                           /* 端点3全速模式大小 */
#define DEF_USB_EP3_HS_SIZE        512                                          /* 端点3高速模式大小 */
#define DEF_USB_EP4_FS_SIZE        64                                           /* 端点4全速模式大小 */
#define DEF_USB_EP4_HS_SIZE        512                                          /* 端点4高速模式大小 */
#define DEF_USB_EP5_FS_SIZE        64                                           /* 端点5全速模式大小 */
#define DEF_USB_EP5_HS_SIZE        512                                          /* 端点5高速模式大小 */
#define DEF_USB_EP6_FS_SIZE        64                                           /* 端点6全速模式大小 */
#define DEF_USB_EP6_HS_SIZE        512                                          /* 端点6高速模式大小 */
#define DEF_USB_EP7_FS_SIZE        64                                           /* 端点7全速模式大小 */
#define DEF_USB_EP7_HS_SIZE        512                                          /* 端点7高速模式大小 */
#define DEF_USB_EP8_FS_SIZE        64                                           /* 端点8全速模式大小 */
#define DEF_USB_EP8_HS_SIZE        512                                          /* 端点8高速模式大小 */

/******************************************************************************/
/* CDC类命令定义 */
#define DEF_GET_LINE_CODING           0X21                                      /* This request allows the host to find out the currently configured line coding */
#define DEF_SET_LINE_CODING           0x20                                      /* Configures DTE rate, stop-bits, parity, and number-of-character */
#define DEF_SET_LINE_CTLSTE           0X22                                      /* This request generates RS-232/V.24 style control signals */
#define DEF_SEND_BREAK                0X23                                      /* Sends special carrier modulation used to specify RS-232 style break */



/******************************************************************************/
/* FTDI Codes */
#define FTDI_VEN_REQ_RESET              0x00
#define FTDI_VEN_REQ_SET_BAUDRATE       0x01
#define FTDI_VEN_REQ_SET_DATA_CHAR      0x02
#define FTDI_VEN_REQ_SET_FLOW_CTRL      0x03
#define FTDI_VEN_REQ_SET_MODEM_CTRL     0x04
#define FTDI_VEN_REQ_GET_MODEM_STA      0x05
#define FTDI_VEN_REQ_SET_EVENT_CHAR     0x06
#define FTDI_VEN_REQ_SET_ERR_CHAR       0x07
#define FTDI_VEN_REQ_SET_LAT_TIMER      0x09
#define FTDI_VEN_REQ_GET_LAT_TIMER      0x0A
#define FTDI_VEN_REQ_SET_BITMODE        0x0B
#define FTDI_VEN_REQ_RD_PINS            0x0C
#define FTDI_VEN_REQ_RD_EEPROM          0x90
#define FTDI_VEN_REQ_WR_EEPROM          0x91
#define FTDI_VEN_REQ_ES_EEPROM          0x92

#define FTDI_MODEM_STA_SIZE             0x02
#define FTDI_MODEM_STA_DUMMY0           0x01
#define FTDI_MODEM_STA_DUMMY1           0x60



//extern volatile UINT8  FLAG_Recv_End;
extern volatile UINT8  FLAG_Send;                                               /* USB发送标志位  */


/******************************************************************************/
/* 变量外扩 */
extern __attribute__ ((aligned(16))) UINT8 EP0_Databuf[ USBHS_UEP0_SIZE ]; 		  /*端点0数据收发缓冲区*/
extern __attribute__ ((aligned(16))) UINT8 EP0_Databuf[ USBHS_UEP0_SIZE ]          __attribute__((section(".DMADATA"))); /*端点0数据收发缓冲区*/
extern __attribute__ ((aligned(16))) UINT8 EP1_Rx_Databuf[ DEF_USB_EP1_FS_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点1数据接收缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP1_Tx_Databuf[ DEF_USB_EP1_FS_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点1数据发送缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP2_Rx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点2数据接收缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP2_Tx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点2数据发送缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP3_Rx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点3数据接收缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP3_Tx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点3数据发送缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP4_Rx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点4数据接收缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP4_Tx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点4数据发送缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP5_Tx_Databuf[ DEF_USB_EP5_FS_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点5数据发送缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP6_Rx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点6数据接收缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP6_Tx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点6数据发送缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP7_Tx_Databuf[ DEF_USB_EP7_FS_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点7数据发送缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP8_Rx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点8数据接收缓冲区 */
extern __attribute__ ((aligned(16))) UINT8 EP8_Tx_Databuf[ USBHS_MAX_PACK_SIZE ]   __attribute__((section(".DMADATA"))); /* 端点8数据发送缓冲区 */

extern const UINT8 *pDescr;
extern volatile UINT8  USBHS_Dev_SetupReqCode;									/* USB2.0高速设备Setup包命令码 */
extern volatile UINT16 USBHS_Dev_SetupReqLen;									/* USB2.0高速设备Setup包长度 */
extern volatile UINT8  USBHS_Dev_SetupReqValueH;								/* USB2.0高速设备Setup包Value高字节 */	
extern volatile UINT8  USBHS_Dev_Config;										/* USB2.0高速设备配置值 */
extern volatile UINT8  USBHS_Dev_Address;										/* USB2.0高速设备地址值 */
extern volatile UINT8  USBHS_Dev_SleepStatus;                                   /* USB2.0高速设备睡眠状态 */
extern volatile UINT8  USBHS_Dev_EnumStatus;                                    /* USB2.0高速设备枚举状态 */
extern volatile UINT8  USBHS_Dev_Endp0_Tog;                                     /* USB2.0高速设备端点0同步标志 */

extern volatile UINT16 USBHS_Up_PackLenMax;                                     /* USB2.0高速设备当前允许上传的包长度最大值(全速64高速512) */

/********************************************************************************/
/* 函数外扩 */
extern void USBHS_RCC_Init( void );												/* USB2.0高速设备RCC初始化 */
extern void USBHS_Device_Endp_Init ( void );									/* USB2.0高速设备端点初始化 */		
extern void USBHS_Device_Init ( FunctionalState sta );							/* USB2.0高速设备初始化 */		
extern void USBHS_Device_SetAddress( UINT32 address );							/* USB2.0高速设备设置设备地址 */		
extern void USBHS_IRQHandler( void );											/* USB2.0高速设备中断服务程序 */		
extern void USBHS_Sleep_WakeUp_Cfg( void );                                     /* USB2.0高速设备睡眠唤醒配置 */

#ifdef __cplusplus
}
#endif

#endif

